1.把字符串形式的整数或浮点数转化为int或float，不是用int和 float函数
提示：可以写一个字典





########################################################################################################################################
2.移出列表中的重复元素，并保持列表原来的顺序
k = [2,2,3,3,4,5,6]
list(set(k))
Out[30]:[2, 3, 4, 5, 6]


#########################################################################################################################################
3.统计文本中各单词出现的次数
import collections
with open('str.txt') as file1:#打开文本文件
    str1=file1.read().split(' ')#将文章按照空格划分开 
print "原文本:\n %s"% str1
print "\n各单词出现的次数：\n %s" % collections.Counter(str1)
print collections.Counter(str1)['was']#以字典的形式存储，每个字符对应的键值就是在文本中出现的次数_>参考
#######################################################################################################################




#########################################################################################################################################
4.把1-4000之间的任意整数转化为罗马数字




